In [54]:
import pandas as pd

data={
    "id_producto": [1, 2, 1, 4, 5],
    "nombre_producto": ["Manzana", "Banana", "Naranja", "Pera", "Uva"],
    "precio": [50.5, None, 18.75, 25.0, None],
    "cantidad": [None, 50, None, 12, 80],
}

df= pd.DataFrame(data)
df

   id_producto nombre_producto  precio  cantidad
0            1         Manzana   50.50       NaN
1            2          Banana     NaN      50.0
2            1         Naranja   18.75       NaN
3            4            Pera   25.00      12.0
4            5             Uva     NaN      80.0

In [55]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 4 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   id_producto      5 non-null      int64
 1   nombre_producto  5 non-null      object
 2   precio           3 non-null      float64
 3   cantidad         3 non-null      float64
dtypes: float64(2), int64(1), object(1)
memory usage: 292.0+ bytes

In [56]:
df.isnull().sum()

id_producto        0
nombre_producto    0
precio             2
cantidad           2
dtype: int64

In [57]:
dfLimpio = df.dropna()
dfLimpio

   id_producto nombre_producto  precio  cantidad
3            4            Pera    25.0      12.0

In [58]:
dfRellenado = df.fillna({"precio":df["precio"].mean(), "cantidad": 0})
dfRellenado

   id_producto nombre_producto     precio  cantidad
0            1         Manzana  50.500000       0.0
1            2          Banana  31.416667      50.0
2            1         Naranja  18.750000       0.0
3            4            Pera  25.000000      12.0
4            5             Uva  31.416667      80.0

In [59]:
df_unicos = dfRellenado.drop_duplicates(subset=["id_producto"])
df_unicos

   id_producto nombre_producto     precio  cantidad
0            1         Manzana  50.500000       0.0
1            2          Banana  31.416667      50.0
3            4            Pera  25.000000      12.0
4            5             Uva  31.416667      80.0